name: "shufflenetv2_1.0x"
layer {
  name: "data1"
  type: "Input"
  top: "data1"
  input_param {
    shape {
      dim: 1
      dim: 3
      dim: 160
      dim: 160
    }
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data1"
  top: "conv1"
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "batch_norm1"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale1"
  type: "Scale"
  bottom: "batch_norm1"
  top: "batch_norm1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "batch_norm1"
  top: "relu1"
}
layer {
  name: "max_pool1"
  type: "Pooling"
  bottom: "relu1"
  top: "max_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
    round_mode: FLOOR
  }
}
layer {
  name: "conv2"
  type: "ConvolutionDepthwise"
  bottom: "max_pool1"
  top: "conv2"
  convolution_param {
    num_output: 24
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "batch_norm2"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale2"
  type: "Scale"
  bottom: "batch_norm2"
  top: "batch_norm2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "batch_norm2"
  top: "conv3"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "batch_norm3"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale3"
  type: "Scale"
  bottom: "batch_norm3"
  top: "batch_norm3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "batch_norm3"
  top: "relu2"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "max_pool1"
  top: "conv4"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "batch_norm4"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale4"
  type: "Scale"
  bottom: "batch_norm4"
  top: "batch_norm4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "batch_norm4"
  top: "relu3"
}
layer {
  name: "conv5"
  type: "ConvolutionDepthwise"
  bottom: "relu3"
  top: "conv5"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm5"
  type: "BatchNorm"
  bottom: "conv5"
  top: "batch_norm5"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale5"
  type: "Scale"
  bottom: "batch_norm5"
  top: "batch_norm5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv6"
  type: "Convolution"
  bottom: "batch_norm5"
  top: "conv6"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm6"
  type: "BatchNorm"
  bottom: "conv6"
  top: "batch_norm6"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale6"
  type: "Scale"
  bottom: "batch_norm6"
  top: "batch_norm6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "batch_norm6"
  top: "relu4"
}
layer {
  name: "concat1"
  type: "Concat"
  bottom: "relu2"
  bottom: "relu4"
  top: "concat1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel1"
  type: "ShuffleChannel"
  bottom: "concat1"
  top: "shuffle_channel1"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split1"
  type: "Slice"
  bottom: "shuffle_channel1"
  top: "split1"
  top: "split2"
  slice_param {
    slice_point: 58
    axis: 1
  }
}
layer {
  name: "conv7"
  type: "Convolution"
  bottom: "split2"
  top: "conv7"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm7"
  type: "BatchNorm"
  bottom: "conv7"
  top: "batch_norm7"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale7"
  type: "Scale"
  bottom: "batch_norm7"
  top: "batch_norm7"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "batch_norm7"
  top: "relu5"
}
layer {
  name: "conv8"
  type: "ConvolutionDepthwise"
  bottom: "relu5"
  top: "conv8"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm8"
  type: "BatchNorm"
  bottom: "conv8"
  top: "batch_norm8"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale8"
  type: "Scale"
  bottom: "batch_norm8"
  top: "batch_norm8"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv9"
  type: "Convolution"
  bottom: "batch_norm8"
  top: "conv9"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm9"
  type: "BatchNorm"
  bottom: "conv9"
  top: "batch_norm9"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale9"
  type: "Scale"
  bottom: "batch_norm9"
  top: "batch_norm9"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "batch_norm9"
  top: "relu6"
}
layer {
  name: "concat2"
  type: "Concat"
  bottom: "split1"
  bottom: "relu6"
  top: "concat2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel2"
  type: "ShuffleChannel"
  bottom: "concat2"
  top: "shuffle_channel2"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split2"
  type: "Slice"
  bottom: "shuffle_channel2"
  top: "split3"
  top: "split4"
  slice_param {
    slice_point: 58
    axis: 1
  }
}
layer {
  name: "conv10"
  type: "Convolution"
  bottom: "split4"
  top: "conv10"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm10"
  type: "BatchNorm"
  bottom: "conv10"
  top: "batch_norm10"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale10"
  type: "Scale"
  bottom: "batch_norm10"
  top: "batch_norm10"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "batch_norm10"
  top: "relu7"
}
layer {
  name: "conv11"
  type: "ConvolutionDepthwise"
  bottom: "relu7"
  top: "conv11"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm11"
  type: "BatchNorm"
  bottom: "conv11"
  top: "batch_norm11"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale11"
  type: "Scale"
  bottom: "batch_norm11"
  top: "batch_norm11"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv12"
  type: "Convolution"
  bottom: "batch_norm11"
  top: "conv12"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm12"
  type: "BatchNorm"
  bottom: "conv12"
  top: "batch_norm12"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale12"
  type: "Scale"
  bottom: "batch_norm12"
  top: "batch_norm12"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu8"
  type: "ReLU"
  bottom: "batch_norm12"
  top: "relu8"
}
layer {
  name: "concat3"
  type: "Concat"
  bottom: "split3"
  bottom: "relu8"
  top: "concat3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel3"
  type: "ShuffleChannel"
  bottom: "concat3"
  top: "shuffle_channel3"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split3"
  type: "Slice"
  bottom: "shuffle_channel3"
  top: "split5"
  top: "split6"
  slice_param {
    slice_point: 58
    axis: 1
  }
}
layer {
  name: "conv13"
  type: "Convolution"
  bottom: "split6"
  top: "conv13"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm13"
  type: "BatchNorm"
  bottom: "conv13"
  top: "batch_norm13"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale13"
  type: "Scale"
  bottom: "batch_norm13"
  top: "batch_norm13"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu9"
  type: "ReLU"
  bottom: "batch_norm13"
  top: "relu9"
}
layer {
  name: "conv14"
  type: "ConvolutionDepthwise"
  bottom: "relu9"
  top: "conv14"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm14"
  type: "BatchNorm"
  bottom: "conv14"
  top: "batch_norm14"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale14"
  type: "Scale"
  bottom: "batch_norm14"
  top: "batch_norm14"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv15"
  type: "Convolution"
  bottom: "batch_norm14"
  top: "conv15"
  convolution_param {
    num_output: 58
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm15"
  type: "BatchNorm"
  bottom: "conv15"
  top: "batch_norm15"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale15"
  type: "Scale"
  bottom: "batch_norm15"
  top: "batch_norm15"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu10"
  type: "ReLU"
  bottom: "batch_norm15"
  top: "relu10"
}
layer {
  name: "concat4"
  type: "Concat"
  bottom: "split5"
  bottom: "relu10"
  top: "concat4"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel4"
  type: "ShuffleChannel"
  bottom: "concat4"
  top: "shuffle_channel4"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "conv16"
  type: "ConvolutionDepthwise"
  bottom: "shuffle_channel4"
  top: "conv16"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm16"
  type: "BatchNorm"
  bottom: "conv16"
  top: "batch_norm16"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale16"
  type: "Scale"
  bottom: "batch_norm16"
  top: "batch_norm16"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv17"
  type: "Convolution"
  bottom: "batch_norm16"
  top: "conv17"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm17"
  type: "BatchNorm"
  bottom: "conv17"
  top: "batch_norm17"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale17"
  type: "Scale"
  bottom: "batch_norm17"
  top: "batch_norm17"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu11"
  type: "ReLU"
  bottom: "batch_norm17"
  top: "relu11"
}
layer {
  name: "conv18"
  type: "Convolution"
  bottom: "shuffle_channel4"
  top: "conv18"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm18"
  type: "BatchNorm"
  bottom: "conv18"
  top: "batch_norm18"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale18"
  type: "Scale"
  bottom: "batch_norm18"
  top: "batch_norm18"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu12"
  type: "ReLU"
  bottom: "batch_norm18"
  top: "relu12"
}
layer {
  name: "conv19"
  type: "ConvolutionDepthwise"
  bottom: "relu12"
  top: "conv19"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm19"
  type: "BatchNorm"
  bottom: "conv19"
  top: "batch_norm19"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale19"
  type: "Scale"
  bottom: "batch_norm19"
  top: "batch_norm19"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv20"
  type: "Convolution"
  bottom: "batch_norm19"
  top: "conv20"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm20"
  type: "BatchNorm"
  bottom: "conv20"
  top: "batch_norm20"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale20"
  type: "Scale"
  bottom: "batch_norm20"
  top: "batch_norm20"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu13"
  type: "ReLU"
  bottom: "batch_norm20"
  top: "relu13"
}
layer {
  name: "concat5"
  type: "Concat"
  bottom: "relu11"
  bottom: "relu13"
  top: "concat5"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel5"
  type: "ShuffleChannel"
  bottom: "concat5"
  top: "shuffle_channel5"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split4"
  type: "Slice"
  bottom: "shuffle_channel5"
  top: "split7"
  top: "split8"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv21"
  type: "Convolution"
  bottom: "split8"
  top: "conv21"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm21"
  type: "BatchNorm"
  bottom: "conv21"
  top: "batch_norm21"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale21"
  type: "Scale"
  bottom: "batch_norm21"
  top: "batch_norm21"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu14"
  type: "ReLU"
  bottom: "batch_norm21"
  top: "relu14"
}
layer {
  name: "conv22"
  type: "ConvolutionDepthwise"
  bottom: "relu14"
  top: "conv22"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm22"
  type: "BatchNorm"
  bottom: "conv22"
  top: "batch_norm22"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale22"
  type: "Scale"
  bottom: "batch_norm22"
  top: "batch_norm22"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv23"
  type: "Convolution"
  bottom: "batch_norm22"
  top: "conv23"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm23"
  type: "BatchNorm"
  bottom: "conv23"
  top: "batch_norm23"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale23"
  type: "Scale"
  bottom: "batch_norm23"
  top: "batch_norm23"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu15"
  type: "ReLU"
  bottom: "batch_norm23"
  top: "relu15"
}
layer {
  name: "concat6"
  type: "Concat"
  bottom: "split7"
  bottom: "relu15"
  top: "concat6"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel6"
  type: "ShuffleChannel"
  bottom: "concat6"
  top: "shuffle_channel6"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split5"
  type: "Slice"
  bottom: "shuffle_channel6"
  top: "split9"
  top: "split10"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv24"
  type: "Convolution"
  bottom: "split10"
  top: "conv24"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm24"
  type: "BatchNorm"
  bottom: "conv24"
  top: "batch_norm24"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale24"
  type: "Scale"
  bottom: "batch_norm24"
  top: "batch_norm24"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu16"
  type: "ReLU"
  bottom: "batch_norm24"
  top: "relu16"
}
layer {
  name: "conv25"
  type: "ConvolutionDepthwise"
  bottom: "relu16"
  top: "conv25"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm25"
  type: "BatchNorm"
  bottom: "conv25"
  top: "batch_norm25"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale25"
  type: "Scale"
  bottom: "batch_norm25"
  top: "batch_norm25"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv26"
  type: "Convolution"
  bottom: "batch_norm25"
  top: "conv26"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm26"
  type: "BatchNorm"
  bottom: "conv26"
  top: "batch_norm26"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale26"
  type: "Scale"
  bottom: "batch_norm26"
  top: "batch_norm26"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu17"
  type: "ReLU"
  bottom: "batch_norm26"
  top: "relu17"
}
layer {
  name: "concat7"
  type: "Concat"
  bottom: "split9"
  bottom: "relu17"
  top: "concat7"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel7"
  type: "ShuffleChannel"
  bottom: "concat7"
  top: "shuffle_channel7"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split6"
  type: "Slice"
  bottom: "shuffle_channel7"
  top: "split11"
  top: "split12"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv27"
  type: "Convolution"
  bottom: "split12"
  top: "conv27"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm27"
  type: "BatchNorm"
  bottom: "conv27"
  top: "batch_norm27"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale27"
  type: "Scale"
  bottom: "batch_norm27"
  top: "batch_norm27"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu18"
  type: "ReLU"
  bottom: "batch_norm27"
  top: "relu18"
}
layer {
  name: "conv28"
  type: "ConvolutionDepthwise"
  bottom: "relu18"
  top: "conv28"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm28"
  type: "BatchNorm"
  bottom: "conv28"
  top: "batch_norm28"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale28"
  type: "Scale"
  bottom: "batch_norm28"
  top: "batch_norm28"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv29"
  type: "Convolution"
  bottom: "batch_norm28"
  top: "conv29"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm29"
  type: "BatchNorm"
  bottom: "conv29"
  top: "batch_norm29"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale29"
  type: "Scale"
  bottom: "batch_norm29"
  top: "batch_norm29"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu19"
  type: "ReLU"
  bottom: "batch_norm29"
  top: "relu19"
}
layer {
  name: "concat8"
  type: "Concat"
  bottom: "split11"
  bottom: "relu19"
  top: "concat8"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel8"
  type: "ShuffleChannel"
  bottom: "concat8"
  top: "shuffle_channel8"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split7"
  type: "Slice"
  bottom: "shuffle_channel8"
  top: "split13"
  top: "split14"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv30"
  type: "Convolution"
  bottom: "split14"
  top: "conv30"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm30"
  type: "BatchNorm"
  bottom: "conv30"
  top: "batch_norm30"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale30"
  type: "Scale"
  bottom: "batch_norm30"
  top: "batch_norm30"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu20"
  type: "ReLU"
  bottom: "batch_norm30"
  top: "relu20"
}
layer {
  name: "conv31"
  type: "ConvolutionDepthwise"
  bottom: "relu20"
  top: "conv31"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm31"
  type: "BatchNorm"
  bottom: "conv31"
  top: "batch_norm31"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale31"
  type: "Scale"
  bottom: "batch_norm31"
  top: "batch_norm31"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv32"
  type: "Convolution"
  bottom: "batch_norm31"
  top: "conv32"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm32"
  type: "BatchNorm"
  bottom: "conv32"
  top: "batch_norm32"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale32"
  type: "Scale"
  bottom: "batch_norm32"
  top: "batch_norm32"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu21"
  type: "ReLU"
  bottom: "batch_norm32"
  top: "relu21"
}
layer {
  name: "concat9"
  type: "Concat"
  bottom: "split13"
  bottom: "relu21"
  top: "concat9"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel9"
  type: "ShuffleChannel"
  bottom: "concat9"
  top: "shuffle_channel9"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split8"
  type: "Slice"
  bottom: "shuffle_channel9"
  top: "split15"
  top: "split16"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv33"
  type: "Convolution"
  bottom: "split16"
  top: "conv33"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm33"
  type: "BatchNorm"
  bottom: "conv33"
  top: "batch_norm33"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale33"
  type: "Scale"
  bottom: "batch_norm33"
  top: "batch_norm33"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu22"
  type: "ReLU"
  bottom: "batch_norm33"
  top: "relu22"
}
layer {
  name: "conv34"
  type: "ConvolutionDepthwise"
  bottom: "relu22"
  top: "conv34"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm34"
  type: "BatchNorm"
  bottom: "conv34"
  top: "batch_norm34"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale34"
  type: "Scale"
  bottom: "batch_norm34"
  top: "batch_norm34"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv35"
  type: "Convolution"
  bottom: "batch_norm34"
  top: "conv35"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm35"
  type: "BatchNorm"
  bottom: "conv35"
  top: "batch_norm35"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale35"
  type: "Scale"
  bottom: "batch_norm35"
  top: "batch_norm35"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu23"
  type: "ReLU"
  bottom: "batch_norm35"
  top: "relu23"
}
layer {
  name: "concat10"
  type: "Concat"
  bottom: "split15"
  bottom: "relu23"
  top: "concat10"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel10"
  type: "ShuffleChannel"
  bottom: "concat10"
  top: "shuffle_channel10"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split9"
  type: "Slice"
  bottom: "shuffle_channel10"
  top: "split17"
  top: "split18"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv36"
  type: "Convolution"
  bottom: "split18"
  top: "conv36"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm36"
  type: "BatchNorm"
  bottom: "conv36"
  top: "batch_norm36"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale36"
  type: "Scale"
  bottom: "batch_norm36"
  top: "batch_norm36"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu24"
  type: "ReLU"
  bottom: "batch_norm36"
  top: "relu24"
}
layer {
  name: "conv37"
  type: "ConvolutionDepthwise"
  bottom: "relu24"
  top: "conv37"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm37"
  type: "BatchNorm"
  bottom: "conv37"
  top: "batch_norm37"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale37"
  type: "Scale"
  bottom: "batch_norm37"
  top: "batch_norm37"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv38"
  type: "Convolution"
  bottom: "batch_norm37"
  top: "conv38"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm38"
  type: "BatchNorm"
  bottom: "conv38"
  top: "batch_norm38"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale38"
  type: "Scale"
  bottom: "batch_norm38"
  top: "batch_norm38"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu25"
  type: "ReLU"
  bottom: "batch_norm38"
  top: "relu25"
}
layer {
  name: "concat11"
  type: "Concat"
  bottom: "split17"
  bottom: "relu25"
  top: "concat11"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel11"
  type: "ShuffleChannel"
  bottom: "concat11"
  top: "shuffle_channel11"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split10"
  type: "Slice"
  bottom: "shuffle_channel11"
  top: "split19"
  top: "split20"
  slice_param {
    slice_point: 116
    axis: 1
  }
}
layer {
  name: "conv39"
  type: "Convolution"
  bottom: "split20"
  top: "conv39"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm39"
  type: "BatchNorm"
  bottom: "conv39"
  top: "batch_norm39"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale39"
  type: "Scale"
  bottom: "batch_norm39"
  top: "batch_norm39"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu26"
  type: "ReLU"
  bottom: "batch_norm39"
  top: "relu26"
}
layer {
  name: "conv40"
  type: "ConvolutionDepthwise"
  bottom: "relu26"
  top: "conv40"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm40"
  type: "BatchNorm"
  bottom: "conv40"
  top: "batch_norm40"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale40"
  type: "Scale"
  bottom: "batch_norm40"
  top: "batch_norm40"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv41"
  type: "Convolution"
  bottom: "batch_norm40"
  top: "conv41"
  convolution_param {
    num_output: 116
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm41"
  type: "BatchNorm"
  bottom: "conv41"
  top: "batch_norm41"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale41"
  type: "Scale"
  bottom: "batch_norm41"
  top: "batch_norm41"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu27"
  type: "ReLU"
  bottom: "batch_norm41"
  top: "relu27"
}
layer {
  name: "concat12"
  type: "Concat"
  bottom: "split19"
  bottom: "relu27"
  top: "concat12"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel12"
  type: "ShuffleChannel"
  bottom: "concat12"
  top: "shuffle_channel12"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "conv42"
  type: "ConvolutionDepthwise"
  bottom: "shuffle_channel12"
  top: "conv42"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm42"
  type: "BatchNorm"
  bottom: "conv42"
  top: "batch_norm42"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale42"
  type: "Scale"
  bottom: "batch_norm42"
  top: "batch_norm42"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv43"
  type: "Convolution"
  bottom: "batch_norm42"
  top: "conv43"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm43"
  type: "BatchNorm"
  bottom: "conv43"
  top: "batch_norm43"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale43"
  type: "Scale"
  bottom: "batch_norm43"
  top: "batch_norm43"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu28"
  type: "ReLU"
  bottom: "batch_norm43"
  top: "relu28"
}
layer {
  name: "conv44"
  type: "Convolution"
  bottom: "shuffle_channel12"
  top: "conv44"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm44"
  type: "BatchNorm"
  bottom: "conv44"
  top: "batch_norm44"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale44"
  type: "Scale"
  bottom: "batch_norm44"
  top: "batch_norm44"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu29"
  type: "ReLU"
  bottom: "batch_norm44"
  top: "relu29"
}
layer {
  name: "conv45"
  type: "ConvolutionDepthwise"
  bottom: "relu29"
  top: "conv45"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm45"
  type: "BatchNorm"
  bottom: "conv45"
  top: "batch_norm45"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale45"
  type: "Scale"
  bottom: "batch_norm45"
  top: "batch_norm45"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv46"
  type: "Convolution"
  bottom: "batch_norm45"
  top: "conv46"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm46"
  type: "BatchNorm"
  bottom: "conv46"
  top: "batch_norm46"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale46"
  type: "Scale"
  bottom: "batch_norm46"
  top: "batch_norm46"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu30"
  type: "ReLU"
  bottom: "batch_norm46"
  top: "relu30"
}
layer {
  name: "concat13"
  type: "Concat"
  bottom: "relu28"
  bottom: "relu30"
  top: "concat13"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel13"
  type: "ShuffleChannel"
  bottom: "concat13"
  top: "shuffle_channel13"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split11"
  type: "Slice"
  bottom: "shuffle_channel13"
  top: "split21"
  top: "split22"
  slice_param {
    slice_point: 232
    axis: 1
  }
}
layer {
  name: "conv47"
  type: "Convolution"
  bottom: "split22"
  top: "conv47"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm47"
  type: "BatchNorm"
  bottom: "conv47"
  top: "batch_norm47"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale47"
  type: "Scale"
  bottom: "batch_norm47"
  top: "batch_norm47"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu31"
  type: "ReLU"
  bottom: "batch_norm47"
  top: "relu31"
}
layer {
  name: "conv48"
  type: "ConvolutionDepthwise"
  bottom: "relu31"
  top: "conv48"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm48"
  type: "BatchNorm"
  bottom: "conv48"
  top: "batch_norm48"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale48"
  type: "Scale"
  bottom: "batch_norm48"
  top: "batch_norm48"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv49"
  type: "Convolution"
  bottom: "batch_norm48"
  top: "conv49"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm49"
  type: "BatchNorm"
  bottom: "conv49"
  top: "batch_norm49"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale49"
  type: "Scale"
  bottom: "batch_norm49"
  top: "batch_norm49"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu32"
  type: "ReLU"
  bottom: "batch_norm49"
  top: "relu32"
}
layer {
  name: "concat14"
  type: "Concat"
  bottom: "split21"
  bottom: "relu32"
  top: "concat14"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel14"
  type: "ShuffleChannel"
  bottom: "concat14"
  top: "shuffle_channel14"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split12"
  type: "Slice"
  bottom: "shuffle_channel14"
  top: "split23"
  top: "split24"
  slice_param {
    slice_point: 232
    axis: 1
  }
}
layer {
  name: "conv50"
  type: "Convolution"
  bottom: "split24"
  top: "conv50"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm50"
  type: "BatchNorm"
  bottom: "conv50"
  top: "batch_norm50"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale50"
  type: "Scale"
  bottom: "batch_norm50"
  top: "batch_norm50"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu33"
  type: "ReLU"
  bottom: "batch_norm50"
  top: "relu33"
}
layer {
  name: "conv51"
  type: "ConvolutionDepthwise"
  bottom: "relu33"
  top: "conv51"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm51"
  type: "BatchNorm"
  bottom: "conv51"
  top: "batch_norm51"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale51"
  type: "Scale"
  bottom: "batch_norm51"
  top: "batch_norm51"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv52"
  type: "Convolution"
  bottom: "batch_norm51"
  top: "conv52"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm52"
  type: "BatchNorm"
  bottom: "conv52"
  top: "batch_norm52"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale52"
  type: "Scale"
  bottom: "batch_norm52"
  top: "batch_norm52"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu34"
  type: "ReLU"
  bottom: "batch_norm52"
  top: "relu34"
}
layer {
  name: "concat15"
  type: "Concat"
  bottom: "split23"
  bottom: "relu34"
  top: "concat15"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel15"
  type: "ShuffleChannel"
  bottom: "concat15"
  top: "shuffle_channel15"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "split13"
  type: "Slice"
  bottom: "shuffle_channel15"
  top: "split25"
  top: "split26"
  slice_param {
    slice_point: 232
    axis: 1
  }
}
layer {
  name: "conv53"
  type: "Convolution"
  bottom: "split26"
  top: "conv53"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm53"
  type: "BatchNorm"
  bottom: "conv53"
  top: "batch_norm53"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale53"
  type: "Scale"
  bottom: "batch_norm53"
  top: "batch_norm53"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu35"
  type: "ReLU"
  bottom: "batch_norm53"
  top: "relu35"
}
layer {
  name: "conv54"
  type: "ConvolutionDepthwise"
  bottom: "relu35"
  top: "conv54"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm54"
  type: "BatchNorm"
  bottom: "conv54"
  top: "batch_norm54"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale54"
  type: "Scale"
  bottom: "batch_norm54"
  top: "batch_norm54"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv55"
  type: "Convolution"
  bottom: "batch_norm54"
  top: "conv55"
  convolution_param {
    num_output: 232
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm55"
  type: "BatchNorm"
  bottom: "conv55"
  top: "batch_norm55"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale55"
  type: "Scale"
  bottom: "batch_norm55"
  top: "batch_norm55"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu36"
  type: "ReLU"
  bottom: "batch_norm55"
  top: "relu36"
}
layer {
  name: "concat16"
  type: "Concat"
  bottom: "split25"
  bottom: "relu36"
  top: "concat16"
  concat_param {
    axis: 1
  }
}
layer {
  name: "shuffle_channel16"
  type: "ShuffleChannel"
  bottom: "concat16"
  top: "shuffle_channel16"
  shuffle_channel_param {
    group: 2
  }
}
layer {
  name: "conv56"
  type: "Convolution"
  bottom: "shuffle_channel16"
  top: "conv56"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    dilation: 1
  }
}
layer {
  name: "batch_norm56"
  type: "BatchNorm"
  bottom: "conv56"
  top: "batch_norm56"
  batch_norm_param {
    use_global_stats: true
    eps: 9.999999747378752e-06
  }
}
layer {
  name: "bn_scale56"
  type: "Scale"
  bottom: "batch_norm56"
  top: "batch_norm56"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu37"
  type: "ReLU"
  bottom: "batch_norm56"
  top: "relu37"
}
layer {
  name: "ave_pool1"
  type: "Pooling"
  bottom: "relu37"
  top: "ave_pool1"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "reshape1"
  type: "Reshape"
  bottom: "ave_pool1"
  top: "reshape1"
  reshape_param {
    shape {
      dim: 0
      dim: 1024
    }
  }
}
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "reshape1"
  top: "fc1"
  inner_product_param {
    num_output: 200
    bias_term: true
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "softmax1"
  type: "Softmax"
  bottom: "fc1"
  top: "softmax1"
  softmax_param {
    axis: 1
  }
}
